Revit 2026 API

# FilterOperatorAndTextString Properties

---

The FilterOperatorAndTextString type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterOperatorStr | A text string denoting the filter operator. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OperatorType | The filter operator. |

#### Reference

FilterOperatorAndTextString Class

Autodesk.Revit.DB Namespace